NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/MGM21/MGM211LA02JNF.svd
        <register>
          <name>CC7_PRE</name>
          <description>No Description</description>
          <addressOffset>0x174</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>PRE</name>
              <description>CC Channel PRE Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CC7_BASE</name>
          <description>No Description</description>
          <addressOffset>0x178</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>BASE</name>
              <description>CC Channel BASE Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CC7_WRAP</name>
          <description>No Description</description>
          <addressOffset>0x17C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WRAP</name>
              <description>CC Channel WRAP Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RAC_NS</name>
      <version>0</version>
      <description>RAC_NS Registers</description>
      <baseAddress>0xB8020000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RAC_RSM</name>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>RAC_SEQ</name>
        <value>38</value>
      </interrupt>
      <registers>
        <register>
          <name>IPVERSION</name>
          <description>No Description</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPVERSION</name>
              <description>IP Version</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EN</name>
          <description>No Description</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable peripheral clock to this module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXENSRCEN</name>
          <description>No Description</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003FFF</resetMask>
          <fields>
            <field>
              <name>SWRXEN</name>
              <description>SW RX Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHANNELBUSYEN</name>
              <description>Channel Busy Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMDETEN</name>
              <description>Timing Detected Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREDETEN</name>
              <description>Preamble Detected Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAMEDETEN</name>
              <description>Frame Detected Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEMODRXREQEN</name>
              <description>DEMOD RX Request Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSRXEN</name>
              <description>PRS RX Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>No Description</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xEF38FFFF</resetMask>
          <fields>
            <field>
              <name>RXMASK</name>
              <description>Receive Enable Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORCESTATEACTIVE</name>
              <description>FSM state force active</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>No special state transition is currently in progress</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>A forced state transition is currently in progress</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXAFTERFRAMEPEND</name>
              <description>TX After Frame Pending</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>A transmit after frame operation is currently not pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>A transmit after frame operation is currently pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXAFTERFRAMEACTIVE</name>
              <description>TX After Frame Active</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>The currently ongoing TX was not initiated by a TXAFTERFRAME command.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>The currently ongoing TX was initiated by a TXAFTERFRAME command.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATE</name>
              <description>Radio State</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Radio is off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXWARM</name>
                  <description>Radio is enabling receiver</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXSEARCH</name>
                  <description>Radio is listening for incoming frames</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFRAME</name>
                  <description>Radio is receiving a frame</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXPD</name>
                  <description>Radio is powering down receiver and going to OFF state</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX2RX</name>
                  <description>Radio remains in receive mode after frame reception is completed</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXOVERFLOW</name>
                  <description>Received data was lost due to full receive buffer</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX2TX</name>
                  <description>Radio is disabling receiver and enabling transmitter</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXWARM</name>
                  <description>Radio is enabling transmitter</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX</name>
                  <description>Radio is transmitting data</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXPD</name>
                  <description>Radio is powering down transmitter and going to OFF state</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX2RX</name>
                  <description>Radio is disabling transmitter and enabling reception</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX2TX</name>
                  <description>Radio is preparing for a transmission after the previous transmission was ended</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHUTDOWN</name>
                  <description>Radio is powering down receiver and going to OFF state</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXENS</name>
              <description>TXEN Status</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>TXEN is not set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>TXEN is set.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXENS</name>
              <description>RXEN Status</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>RXEN is not set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>RXEN is set.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>No Description</description>
          <addressOffset>0x010</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xC000F1FF</resetMask>
          <fields>
            <field>
              <name>TXEN</name>
              <description>Transmitter Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FORCETX</name>
              <description>Force TX Command</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXONCCA</name>
              <description>Transmit On CCA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLEARTXEN</name>
              <description>Clear TX Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXAFTERFRAME</name>
              <description>TX After Frame</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXDIS</name>
              <description>TX Disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLEARRXOVERFLOW</name>
              <description>Clear RX Overflow</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXCAL</name>
              <description>Start an RX Calibration</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXDIS</name>
              <description>RX Disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PAENSET</name>
              <description>PAEN Set</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PAENCLEAR</name>
              <description>PAEN Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LNAENSET</name>
              <description>LNAEN Set</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LNAENCLEAR</name>
              <description>LNAEN Clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
